DataProcessors/ИА_РабочийСтолСтратегическогоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИА_РабочийСтолСтратегическогоУправления</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ИА_ТипыЭлементовСтратегическогоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ТипыЭлементовСтратегическогоУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Цель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Программа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Раздел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ТипыЗадачАдминШкалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ТипыЗадачАдминШкалы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Главная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Первоочередная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖизненноВажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производственная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_СтратегическоеУправление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_СтратегическоеУправление</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ТипыЭлементовСтратегическогоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдеальнаяКартина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСитуация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замысел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовНаВыполнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьНаРабочемСтоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ТипыЗадачАдминШкалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОВыполнении</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетОтправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаКоррЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_СтратегическоеУправление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАрхива</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретРедактированияБезЗРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКоррекция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коррекция_Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коррекция_Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коррекция_Добавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коррекция_ЗРС</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависитОтЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_СтратегическоеУправление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Права</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Редактирование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ИА_РабочийСтолСтратегическогоУправления/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СтратегияПриАктивизацииСтроки(Элемент)
	ОбновитьДоступностьСоздатьВыполнитьЗадачу();		
	ОбновитьДоступностьДобавления();
	ОбновитьДоступностьСдвигов();
	ОбновитьДоступностьАрхиваИКоррекции();
	ОбновитьДоступностьПечати();
	//ОбновитьЗаголовкиДобавления();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьПечати()
	Элементы.СтратегияПечатьПрограммы.Доступность = ложь;
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено ТОгда
		Возврат;
	КонецЕсли;
	
	типЗ = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Программа");
	Элементы.СтратегияПечатьПрограммы.Доступность = тд.ТипЭлемента = типЗ;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьСдвигов()
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено ТОгда
		Элементы.СтратегияКонтекстноеМенюСдвинутьВверх.Доступность = Ложь;
		Элементы.СтратегияКонтекстноеМенюСдвинутьВниз.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	ТекИд = Элементы.Стратегия.ТекущаяСтрока;
	
	Элементы.СтратегияКонтекстноеМенюСдвинутьВверх.Доступность =  не тд.ЭтоАрхив и тд.ПравоРедактирования и ((не тд.ЭтоКоррекция) ИЛИ тд.Коррекция_Добавление);
	Элементы.СтратегияКонтекстноеМенюСдвинутьВниз.Доступность =  не тд.ЭтоАрхив и тд.ПравоРедактирования и ((не тд.ЭтоКоррекция) ИЛИ тд.Коррекция_Добавление);
	
	Родитель = ?(тд.ПолучитьРодителя() = Неопределено, СтратегияДерево, тд.ПолучитьРодителя());
	Коллекция = Родитель.ПолучитьЭлементы();
	Если ТекИд = Коллекция[0].ПолучитьИдентификатор() ТОгда // первая строка
		Элементы.СтратегияКонтекстноеМенюСдвинутьВверх.Доступность = Ложь;
	КонецЕсли;
	
	Если ТекИд = Коллекция[Коллекция.Количество()-1].ПолучитьИдентификатор() ТОгда // последняя строка
		Элементы.СтратегияКонтекстноеМенюСдвинутьВниз.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьАрхиваИКоррекции()
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено ТОгда
		Возврат;
	КонецЕсли;
	
	Элементы.СтратегияКонтекстноеМенюСкрытьАрхивныеКопии.Доступность = тд.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Программа") и не тд.ЭтоАрхив и не тд.ЭтоКоррекция;
	Элементы.СтратегияКонтекстноеМенюПоказатьАрхивныеКопии.Доступность = тд.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Программа") и не тд.ЭтоАрхив и не тд.ЭтоКоррекция;
	
	КоррекцияДоступна = тд.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача");
	
	Элементы.СтратегияИзменитьТекущуюЗадачу.Доступность = ложь;
	Элементы.СтратегияДобавитьЗадачу.Доступность = КоррекцияДоступна;
	Элементы.СтратегияУдалитьЗадачу.Доступность = ложь;
	Элементы.СтратегияОтменитьКоррекцию.Доступность = КоррекцияДоступна и тд.ЭтоКоррекция;
	Элементы.СтратегияОформитьЗРСНаКоррекцию.Доступность = тд.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Программа") 
	ИЛИ тд.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.ТипЗадачи")
	ИЛИ тд.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Раздел")
	ИЛИ тд.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача");
	
	Если КоррекцияДоступна Тогда
		УжеЕстьКоррекция = тд.ЭтоКоррекция;	
		Если не УжеЕстьКоррекция Тогда
			ЭлементыРод = СтратегияДерево.НайтиПоИдентификатору(тд.ПолучитьИдентификатор()).ПолучитьРодителя().ПолучитьЭлементы();
			индексТек = ЭлементыРод.Индекс(тд); 
			Если индексТек < ЭлементыРод.Количество()-1 Тогда
				СледСтрока = ЭлементыРод.Получить(индексТек+1);
				УжеЕстьКоррекция = СледСтрока.ЭтоКоррекция и не СледСтрока.Коррекция_Добавление;
			КонецЕсли;
		КонецЕсли;
		
		Элементы.СтратегияИзменитьТекущуюЗадачу.Доступность = не УжеЕстьКоррекция и не тд.Выполнено;
		Элементы.СтратегияУдалитьЗадачу.Доступность = не УжеЕстьКоррекция и не тд.Выполнено;
	КонецЕсли;
	
	Если не ЕстьПравоРедактирования Тогда
		Элементы.СтратегияИзменитьТекущуюЗадачу.Доступность = ложь;
		Элементы.СтратегияДобавитьЗадачу.Доступность = ложь;
		Элементы.СтратегияУдалитьЗадачу.Доступность = ложь;
		Элементы.СтратегияОтменитьКоррекцию.Доступность = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовкиДобавления()
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено ТОгда
		Возврат;
	КонецЕсли;
	
	ЗаголовокДобСтроку = "Добавить строку";
	ЗаголовокДобПодчСтроку = "Добавить подчиненную строку";
	
	// Подчиненные
	Отбор = Новый Структура("ТипЭлемента", тд.ТипЭлемента);
	возмПодч = ИерархияСУ.НайтиСтроки(Отбор);
	
	ДобТип = Неопределено;
	Если возмПодч.количество() > 0 Тогда
		ЗаголовокДобПодчСтроку = "Добавить ";
		Первый = истина;
		Для каждого стр из возмПодч Цикл
			Если не Первый Тогда
				ЗаголовокДобПодчСтроку = ЗаголовокДобПодчСтроку + " или ";
			КонецЕсли;
			
			ЗаголовокДобПодчСтроку = ЗаголовокДобПодчСтроку + стр.ПодчиненныйТип;
			Первый = Ложь;
		КонецЦикла;		
	КонецЕсли;
	
	Элементы.СтратегияДобавитьПодчиненнуюСтроку.Заголовок = ЗаголовокДобПодчСтроку;
	Элементы.СтратегияКонтекстноеМенюДобавитьПодчиненнуюСтроку.Заголовок = ЗаголовокДобПодчСтроку;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьДобавления()
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено ТОгда
		Возврат;
	КонецЕсли;
	
	типЗ = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача");
	Элементы.СтратегияДобавитьПодчиненнуюСтроку.Доступность = тд.ТипЭлемента <> типЗ и не тд.ЭтоАрхив и тд.ПравоРедактирования и не тд.ЭтоКоррекция;
	Элементы.СтратегияКонтекстноеМенюДобавитьПодчиненнуюСтроку.Доступность = тд.ТипЭлемента <> типЗ и не тд.ЭтоАрхив и тд.ПравоРедактирования и не тд.ЭтоКоррекция;
	
	МожноДобавлятьСтроки = не тд.ЭтоАрхив и не тд.ЭтоКоррекция;
	текРод = тд.ПолучитьРодителя();
	Если МожноДобавлятьСтроки И текРод<>Неопределено Тогда
		МожноДобавлятьСтроки = текРод.ПравоРедактирования;
	КонецЕсли;
	Элементы.СтратегияДобавитьСтроку.Доступность = МожноДобавлятьСтроки;
	Элементы.СтратегияКонтекстноеМенюДобавитьСтроку.Доступность = МожноДобавлятьСтроки;
	
	Элементы.СтратегияКонтекстноеМенюУдалить.Доступность = не тд.ЭтоАрхив и тд.ПравоРедактирования и не тд.ЭтоКоррекция;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьСоздатьВыполнитьЗадачу()
	Элементы.СтратегияСоздатьЗадачуКЦ.Доступность = Ложь;
	Элементы.СтратегияВыполнитьЗадачу.Доступность = Ложь;
	Элементы.СтратегияОтправитьОтчетОбИсполнении.Доступность = Ложь;
	тд = Элементы.Стратегия.ТекущиеДанные;
	
	если тд = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтратегияСоздатьЗадачуКЦ.Доступность = 
	тд.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача") 
	и не ЗначениеЗаполнено(тд.Задача) и не тд.Выполнено и ЗначениеЗаполнено(тд.Ссылка) и не тд.ЭтоАрхив и не тд.ЭтоКоррекция И ИА_АдминшкалаСервер.МожноВыполнитьЗадачу(тд.Ссылка);
	
	Элементы.СтратегияВыполнитьЗадачу.Доступность = 
	тд.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача") 
	и не тд.Выполнено и ЗначениеЗаполнено(тд.Ссылка) И ИА_АдминшкалаСервер.МожноВыполнитьЗадачу(тд.Ссылка) и не тд.ЭтоАрхив и тд.ПравоРедактирования и не тд.ЭтоКоррекция;
	
	Элементы.СтратегияОтправитьОтчетОбИсполнении.Доступность = 
	тд.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача") 
	и не тд.Выполнено и ЗначениеЗаполнено(тд.Ссылка) и не тд.ЭтоАрхив и не тд.ЭтоКоррекция;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не ИА_Защита_Общий.ЛицензияДоступна("Админшкала") Тогда
		возврат;
	КонецЕсли;
	
	//
	Параметры.Свойство("Отбор_ЗадачиПоста", Отбор_ЗадачиПоста);
	Параметры.Свойство("РежимВыбора", РежимВыбора);
	Параметры.Свойство("Отбор_ТолькоНезавершенные", Отбор_ТолькоНезавершенные);
	//
	
	спрСтратегия = Метаданные.Справочники.ИА_СтратегическоеУправление;
	ЕстьПравоРедактирования = ПравоДоступа("Изменение",спрСтратегия) и ПравоДоступа("Добавление",спрСтратегия);
	
	Если не ЕстьПравоРедактирования Тогда
		Элементы.Стратегия.ТолькоПросмотр = истина;
		
		Элементы.СтратегияДобавитьСтроку.Видимость = ложь;
		Элементы.СтратегияДобавитьПодчиненнуюСтроку.Видимость = ложь;
		
		Элементы.СтратегияКонтекстноеМенюДобавитьСтроку.Видимость = ложь;
		Элементы.СтратегияКонтекстноеМенюДобавитьПодчиненнуюСтроку.Видимость = ложь;
		Элементы.СтратегияКонтекстноеМенюСдвинутьВверх.Видимость = ложь;
		Элементы.СтратегияКонтекстноеМенюСдвинутьВниз.Видимость = ложь;
		Элементы.СтратегияКонтекстноеМенюУдалить.Видимость = ложь;
	КонецЕсли;
	
	Элементы.ДекорацияЦель.Заголовок = Константы.ИА_ЦельКомпании.Получить();
	
	мДерево = РеквизитФормыВЗначение("СтратегияДерево");
	ИменаКолонокДерева = "";
	Для каждого Колонка Из мДерево.Колонки Цикл
		ИменаКолонокДерева = ИменаКолонокДерева + "," + Колонка.Имя;
	КонецЦикла;  
	
	ИменаКолонокДерева = Сред(ИменаКолонокДерева, 2);
	
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	ЗаполнитьТаблицуИндексов();
	ЗаполнитьСписокТиповЗадач();
	ЗаполнитьИерархиюСУ();
	
	//
	Лого = Константы.ИА_ЛоготипКомпании.Получить();
	Если ЗначениеЗаполнено(лого) ТОгда
		дд = лого.Получить();
		Если ЗначениеЗаполнено(дд) Тогда
			уид1 = Новый УникальныйИдентификатор;
			АдресКартинкиЛоготип = ПоместитьВоВременноеХранилище(дд,уид1);
		КонецЕсли;
	КонецЕсли;
	Элементы.ПолеЛоготип.Видимость = АдресКартинкиЛоготип<>"";
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокТиповЗадач()
	СписокТиповЗадач.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИА_ТипыЗадачАдминШкалы.Ссылка
	|ИЗ
	|	Перечисление.ИА_ТипыЗадачАдминШкалы КАК ИА_ТипыЗадачАдминШкалы";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокТиповЗадач.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДерево()	
	дер = ИА_Защита_Админшкала.ПолучитьДеревоСУ(Отбор_ТолькоПросроченные, Отбор_ТолькоРабочие, Отбор_ТолькоНезавершенные, Отбор_ЗадачиПоста, Отбор_ПрограммыПоста, Отбор_Архив, Отбор_ЗРС);
	ЗначениеВРеквизитФормы(Дер,"СтратегияДерево");
КонецПроцедуры

&НаКлиенте
Функция АктивизироватьСтроку(пСсылка, Строки) Экспорт
	Для каждого стр из Строки Цикл
		Если стр.Ссылка = пСсылка Тогда
			Элементы.стратегия.ТекущаяСтрока = стр.ПолучитьИдентификатор();
			Возврат истина;
		КонецЕсли;
		
		нашли = АктивизироватьСтроку(пСсылка, стр.ПолучитьЭлементы());
		Если нашли тогда
			Возврат истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуИндексов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИА_ТипыЭлементовСтратегическогоУправления.Ссылка КАК ТипЭлемента,
	|	ИА_ТипыЭлементовСтратегическогоУправления.Порядок КАК Индекс
	|ИЗ
	|	Перечисление.ИА_ТипыЭлементовСтратегическогоУправления КАК ИА_ТипыЭлементовСтратегическогоУправления";
	рез = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(рез,"ИндексыКартинки");
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьИерархиюСУ()
	ИерархияСУ.Очистить();
	
	тз = ИА_АдминшкалаСервер.ПолучитьТаблицуИерархииСУ();
	Для каждого стр из тз Цикл
		Новстр = ИерархияСУ.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
		Новстр.ИмяПодчТипа = XMLстрока(стр.ПодчиненныйТип);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачуКЦ(Команда)
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд.Срок < НачалоДня(ТекущаяДата()) Тогда
		ПоказатьПредупреждение(,"Неверно указан срок задачи!");
		Возврат;
	КонецЕсли;
	
	тд.Задача = ПолучитьЗадачуКЦ(тд.Ссылка, тд.Ответственный, тд.Содержание, тд.Срок);
	Если ЗначениеЗаполнено(тд.задача) Тогда
		Элементы.СтратегияСоздатьЗадачуКЦ.Доступность = ложь;
		тд.ЗадачаОтправлена = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗадачуКЦ(СсылкаСтратегии, Ответственный, Содержание, Срок)
	ОбСтратег = СсылкаСтратегии.Получитьобъект();
	ОбСтратег.Задача = ИА_АдминшкалаСервер.СоздатьЗадачуСервер(Ответственный,Содержание, Срок, Содержание, СсылкаСтратегии);
	ОбСтратег.Записать();
	Возврат ОбСтратег.Задача;
КонецФункции

&НаКлиенте
Процедура СтратегияПриИзменении(Элемент)
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	Если СокрЛП(тд.Содержание) = "" Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСтрокаДерева = Новый Структура(ИменаКолонокДерева);
	ЗаполнитьЗначенияСвойств(СтруктураСтрокаДерева, ТД);
	
	РодительСтроки = ТД.ПолучитьРодителя();
	Если РодительСтроки <> Неопределено тогда
		СтруктураСтрокаДерева.Вставить("Родитель", РодительСтроки.Ссылка);
	Иначе
		СтруктураСтрокаДерева.Вставить("Родитель", ПредопределенноеЗначение("Справочник.ИА_СтратегическоеУправление.ПустаяСсылка"));
	КонецЕсли;
	ЗаписатьТекСтрокуБезКонтекста(СтруктураСтрокаДерева);
	ТД.Ссылка = СтруктураСтрокаДерева.Ссылка;
	
	ПересчитатьИтогиНаКлиенте(ТД)
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиНаКлиенте(ТекСтрока)
	Если ТекСтрока.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача") Тогда
		
		Если    ТекСтрока.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ИА_ТипыЗадачАдминШкалы.Рабочая")
			ИЛИ ТекСтрока.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ИА_ТипыЗадачАдминШкалы.Производственная")
			Тогда
			ТекДата = НачалоДня(ТекущаяДата());
			ТекСтрока.ЗадачВсего = 1;
			Если ЗначениеЗаполнено(ТекСтрока.Срок) И ТекСтрока.Срок < ТекДата Тогда
				ТекСтрока.ЗадачПросрочено = 1;
			Иначе
				ТекСтрока.ЗадачПросрочено = 0;
			КонецЕсли; 
			
			ТекСтрока.ЗадачВыполнено = ?(ТекСтрока.Выполнено, 1, 0);
			
			ОбновитьИтогиВВетке(ТекСтрока);
		КонецЕсли; 
	Иначе
		ОбновитьДеревоССохранениемСостояния();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтогиВВетке(СтрокаДерева)
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Пока РодительСтроки <> Неопределено Цикл
		Итоги = Новый Структура("ЗадачВсего, ЗадачПросрочено, ЗадачВыполнено, ПроцентВыполнения", 0, 0, 0, 0);
		Ветки = РодительСтроки.ПолучитьЭлементы();
		Для каждого Стр Из Ветки Цикл
			Итоги.ЗадачВсего        = Итоги.ЗадачВсего      + Стр.ЗадачВсего;
			Итоги.ЗадачВыполнено    = Итоги.ЗадачВыполнено  + Стр.ЗадачВыполнено;
			Итоги.ЗадачПросрочено   = Итоги.ЗадачПросрочено + Стр.ЗадачПросрочено;
		КонецЦикла;  
		Итоги.ПроцентВыполнения = ?(Итоги.ЗадачВсего = 0, 0, 100 * Итоги.ЗадачВыполнено / Итоги.ЗадачВсего);
		ЗаполнитьЗначенияСвойств(РодительСтроки, Итоги);
		
		РодительСтроки = РодительСтроки.ПолучитьРодителя();
	КонецЦикла; 
КонецПроцедуры



&НаСервереБезКонтекста
Процедура ЗаписатьТекСтрокуБезКонтекста(СтруктураСтрокаДерева)
	пСтрока	= СтруктураСтрокаДерева;
	
	Если пСтрока.Ссылка.Пустая() Тогда
		обСтратег = Справочники.ИА_СтратегическоеУправление.СоздатьЭлемент();
	Иначе
		обСтратег = пСтрока.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	
	ЗаполнитьЗначенияСвойств(обСтратег, пСтрока,,"Ссылка");
	обСтратег.Наименование = Лев(СокрЛП(пСтрока.Содержание),50);
	Если обСтратег.Автор.Пустая() Тогда
		обСтратег.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	// порядок
	Если пСтрока.Ссылка.Пустая() Тогда
		Если СтруктураСтрокаДерева.Свойство("СледЭлем") И СтруктураСтрокаДерева.СледЭлем<>Неопределено Тогда// надо вставить строку на место след элем
			обСтратег.Порядок = СтруктураСтрокаДерева.СледЭлем.Порядок;	
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ИА_СтратегическоеУправление.Ссылка,
			               |	ИА_СтратегическоеУправление.Порядок
			               |ИЗ
			               |	Справочник.ИА_СтратегическоеУправление КАК ИА_СтратегическоеУправление
			               |ГДЕ
			               |	ИА_СтратегическоеУправление.Родитель = &Родитель
			               |	И ИА_СтратегическоеУправление.ПометкаУдаления = ЛОЖЬ
			               |	И (НЕ ИА_СтратегическоеУправление.ЭтоКоррекция
			               |			ИЛИ ИА_СтратегическоеУправление.Коррекция_Добавление)
			               |	И ИА_СтратегическоеУправление.Порядок >= &Порядок";
			Запрос.УстановитьПараметр("Родитель", обСтратег.Родитель);
			Запрос.УстановитьПараметр("Порядок", обСтратег.Порядок);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ТекОБ = Выборка.Ссылка.ПолучитьОбъект();
				ТекОБ.Порядок = ТекОБ.Порядок + 1;	
				ТекОБ.Записать();
			КонецЕсли;

		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	МАКСИМУМ(ИА_СтратегическоеУправление.Порядок) КАК Порядок
			|ИЗ
			|	Справочник.ИА_СтратегическоеУправление КАК ИА_СтратегическоеУправление
			|ГДЕ
			|	ИА_СтратегическоеУправление.Родитель = &Родитель
			|	И ИА_СтратегическоеУправление.ПометкаУдаления = ЛОЖЬ
			|	И (НЕ ИА_СтратегическоеУправление.ЭтоКоррекция
			|			ИЛИ ИА_СтратегическоеУправление.Коррекция_Добавление)";
			Запрос.УстановитьПараметр("Родитель", обСтратег.Родитель);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() и Выборка.Порядок<>NULL Тогда
				обСтратег.Порядок = Выборка.Порядок + 1;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//
	
	обСтратег.Записать();
	
	пСтрока.Ссылка = обСтратег.Ссылка;
КонецПроцедуры 


&НаСервере
Процедура ЗаписатьТекСтроку(идСтроки)
	
	пСтрока = СтратегияДерево.НайтиПоИдентификатору(идСтроки);
	СтруктураСтрокаДерева = Новый Структура(ИменаКолонокДерева);
	ЗаполнитьЗначенияСвойств(СтруктураСтрокаДерева, пСтрока);
	
	РодительСтроки = пСтрока.ПолучитьРодителя();
	Если РодительСтроки <> Неопределено тогда
		СтруктураСтрокаДерева.Вставить("Родитель", РодительСтроки.Ссылка);
	Иначе
		СтруктураСтрокаДерева.Вставить("Родитель", ПредопределенноеЗначение("Справочник.ИА_СтратегическоеУправление.ПустаяСсылка"));
	КонецЕсли;
	
	//
	Если РодительСтроки = Неопределено Тогда
		РодительСтроки = СтратегияДерево;
	КонецЕсли;
	ТекИнд = РодительСтроки.ПолучитьЭлементы().Индекс(пСтрока);
	СледЭлем = Неопределено;
	Если РодительСтроки.ПолучитьЭлементы().Количество()-1 > ТекИнд Тогда
		СледЭлем = РодительСтроки.ПолучитьЭлементы().Получить(ТекИнд+1).ссылка;
	КонецЕсли;
	СтруктураСтрокаДерева.Вставить("СледЭлем", СледЭлем);
	//
	ЗаписатьТекСтрокуБезКонтекста(СтруктураСтрокаДерева);
	пСтрока.Ссылка = СтруктураСтрокаДерева.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоССохранениемСостояния()
	СохранитьТекущееСостояниеДерева();
	//
	ОбновитьДерево();
	//
	ВосстановитьСостояниеДерева();
	
	ОбновитьДоступностьСоздатьВыполнитьЗадачу();
КонецПроцедуры

&НаКлиенте
Процедура СтратегияСодержаниеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	тд = Элементы.Стратегия.ТекущиеДанные;
	тд.Содержание = Элемент.ТекстРедактирования;
	Если СокрЛП(тд.Содержание) = "" Тогда
		Возврат;
	КонецЕсли;
	//
	ЗаписатьТекСтроку(Элементы.Стратегия.ТекущаяСтрока);
	//
	парам = Новый Структура("Ключ", тд.Ссылка);
	ОткрытьФорму("Справочник.ИА_СтратегическоеУправление.ФормаОбъекта",парам,ЭтаФорма,,,,Новый ОписаниеОповещения("СтратегияСодержаниеОткрытиеЗавершение", ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СтратегияСодержаниеОткрытиеЗавершение(рез, дп) Экспорт
	ОбновитьДеревоССохранениемСостояния();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодчиненнуюСтроку_Команда(Команда)
	ДобавитьСтрокуВДерево(истина);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВДерево(Подчиненная)
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если Подчиненная и тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	Если Подчиненная Тогда
		Если не тд.правоРедактирования Тогда
			Сообщить("Вам запрещено редактирование!");
			Возврат;
		КонецЕсли;
		
		Если тд.ПолучитьРодителя()<>Неопределено И СокрЛП(тд.ПолучитьРодителя().Содержание)="" Тогда
			Сообщить("Укажите содержание текущей строки!");
			Возврат;
		КонецЕсли;
		ТипЭлементаРодителя = тд.ТипЭлемента;
	Иначе
		Если тд = Неопределено Тогда
			ТипЭлементаРодителя = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.ПустаяСсылка");
		Иначе
			ТипЭлементаРодителя = тд.ТипРодителя;
		КонецЕсли;
	КонецЕсли;
	
	Отбор = Новый Структура("ТипЭлемента", ТипЭлементаРодителя);
	возмПодч = ИерархияСУ.НайтиСтроки(Отбор);
	
	ДобТип = Неопределено;
	Если возмПодч.количество() = 0 Тогда
		возврат;
	ИначеЕсли возмПодч.количество() = 1 Тогда
		ДобТип = возмПодч[0].ПодчиненныйТип;
	Иначе
		список = Новый СписокЗначений;
		Для каждого стр из возмПодч Цикл
			список.Добавить(стр.ПодчиненныйТип);
		КонецЦикла;
		
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ДобавитьСтрокуВДеревоЗавершение", ЭтотОбъект, Новый Структура("Подчиненная, тд, ТипЭлементаРодителя", Подчиненная, тд, ТипЭлементаРодителя)), список);
		Возврат;
	КонецЕсли;
	
	
	ДобавитьСтрокуВДеревоФрагмент(ДобТип, Подчиненная, тд, ТипЭлементаРодителя);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВДеревоЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Подчиненная = ДополнительныеПараметры.Подчиненная;
	тд = ДополнительныеПараметры.тд;
	ТипЭлементаРодителя = ДополнительныеПараметры.ТипЭлементаРодителя;
	
	
	ДобТип = ВыбранныйЭлемент;
	Если ДобТип = Неопределено Тогда
		возврат;
	Иначе
		ДобТип = ДобТип.Значение;
	КонецЕсли;
	
	ДобавитьСтрокуВДеревоФрагмент(ДобТип, Подчиненная, тд, ТипЭлементаРодителя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВДеревоФрагмент(Знач ДобТип, Знач Подчиненная, Знач тд, Знач ТипЭлементаРодителя)
	
	Перем ВыбТипЗадачи, Новстр, род, Родитель;
	
	ВыбТипЗадачи = Неопределено;
	Если ДобТип = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.ТипЗадачи") Тогда
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ДобавитьСтрокуВДеревоФрагментЗавершение", ЭтотОбъект, Новый Структура("ДобТип, Подчиненная, тд, ТипЭлементаРодителя", ДобТип, Подчиненная, тд, ТипЭлементаРодителя)), СписокТиповЗадач);
		Возврат;
	КонецЕсли;
	
	ДобавитьСтрокуВДеревоФрагментФрагмент(ВыбТипЗадачи, ДобТип, Подчиненная, тд, ТипЭлементаРодителя);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВДеревоФрагментЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ДобТип = ДополнительныеПараметры.ДобТип;
	Подчиненная = ДополнительныеПараметры.Подчиненная;
	тд = ДополнительныеПараметры.тд;
	ТипЭлементаРодителя = ДополнительныеПараметры.ТипЭлементаРодителя;
	
	
	ВыбТипЗадачи = ВыбранныйЭлемент;
	Если ВыбТипЗадачи = Неопределено Тогда
		возврат;
	Иначе
		ВыбТипЗадачи = ВыбТипЗадачи.Значение;
		//-> Григорьева
		Родитель = ?(Подчиненная, тд.Ссылка, СтратегияДерево.НайтиПоИдентификатору(тд.ПолучитьИдентификатор()).ПолучитьРодителя().Ссылка);
		Если ТипЗадачиСуществует(ВыбТипЗадачи, Родитель) Тогда
			ИА_КСУОбщийКлиентСервер.СообщитьПользователю("Тип задачи """ + ВыбТипЗадачи + """ уже используется в рамках текущей программы.");
			Возврат;
		КонецЕсли; 
		//<- Григорьева
	КонецЕсли;
	
	ДобавитьСтрокуВДеревоФрагментФрагмент(ВыбТипЗадачи, ДобТип, Подчиненная, тд, ТипЭлементаРодителя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВДеревоФрагментФрагмент(Знач ВыбТипЗадачи, Знач ДобТип, Знач Подчиненная, Знач тд, Знач ТипЭлементаРодителя)
	
	Перем Новстр, род;
	
	Если Подчиненная Тогда
		Новстр = СтратегияДерево.НайтиПоИдентификатору(тд.ПолучитьИдентификатор()).ПолучитьЭлементы().Добавить();
	Иначе
		Если тд = Неопределено Тогда
			Новстр = СтратегияДерево.ПолучитьЭлементы().Добавить();
		Иначе
			род = СтратегияДерево.НайтиПоИдентификатору(тд.ПолучитьИдентификатор()).ПолучитьРодителя();
			Если род = Неопределено Тогда
				Новстр = СтратегияДерево.ПолучитьЭлементы().Добавить();
			Иначе
				родЭлем = СтратегияДерево.НайтиПоИдентификатору(тд.ПолучитьИдентификатор()).ПолучитьРодителя().ПолучитьЭлементы();
				Новстр = родЭлем.Добавить();
				
				ТекИнд = родЭлем.Индекс(тд);
				родЭлем.Сдвинуть(родЭлем.Количество()-1,-(родЭлем.Количество() - ТекИнд - 2)); 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Новстр.ТипЭлемента = ДобТип;
	Новстр.ТипРодителя = ТипЭлементаРодителя;
	Новстр.ИндексКартинки = ПолучитьИндексКартинки(ДобТип);
	Новстр.ЗадачаОтправлена = 2;
	Новстр.Содержание = "<...>";
	Новстр.ПравоРедактирования = истина;
	Новстр.ПравоПросмотра = истина;
	
	Если ВыбТипЗадачи<>Неопределено Тогда
		Новстр.ТипЗадачи = ВыбТипЗадачи;
		Новстр.Содержание = ВыбТипЗадачи;
	КонецЕсли;
	
	ТекИД = Новстр.ПолучитьИдентификатор();
	ЗаписатьТекСтроку(ТекИД);
	Элементы.Стратегия.ТекущаяСтрока = ТекИД;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИндексКартинки(пТип)
	Отбор = новый Структура("ТипЭлемента", пТип);
	рез = ИндексыКартинки.НайтиСтроки(Отбор);
	Возврат рез[0].Индекс;
КонецФункции

&НаКлиенте
Процедура СтратегияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ДобавитьСтрокуВДерево(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	ДобавитьСтрокуВДерево(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СтратегияПередУдалением(Элемент, Отказ)
	тд = Элементы.Стратегия.ТекущиеДанные;
	
	Если (не тд.ПравоРедактирования) или тд.ЭтоАрхив Тогда
		отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СтратегияПередУдалениемЗавершение", ЭтотОбъект, Новый Структура("тд", тд)), "Вы уверены?", РежимДиалогаВопрос.ДаНет);
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СтратегияПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	тд = ДополнительныеПараметры.тд;
	
	
	Если РезультатВопроса<>КодВозвратаДиалога.Да Тогда
		возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тд.Ссылка) Тогда
		ТекРод = тд.ПолучитьРодителя();
		
		ПометитьНаУдаление(тд.Ссылка);	
		
		Если ТекРод<> Неопределено Тогда
			Элементы.Стратегия.ТекущаяСтрока = ТекРод.ПолучитьИдентификатор();
		КонецЕсли;
		
		ОбновитьДеревоССохранениемСостояния();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПометитьНаУдаление(пСсылка)
	об = пСсылка.ПолучитьОбъект();
	об.УстановитьПометкуУдаления(истина);
КонецПроцедуры


&НаКлиенте
Процедура СохранитьТекущееСостояниеДерева()
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	ОткрытыеГруппы.Очистить();
	ЗаполнитьРазвернутыеГруппы(СтратегияДерево.ПолучитьЭлементы());
	
	Если тд.ЭтоКоррекция Тогда
		ТекущаяСсылка = тд.СсылкаНаКоррЭлемент;	
	Иначе
		ТекущаяСсылка = тд.Ссылка;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРазвернутыеГруппы(пЭлементы)
	Для каждого стр из пЭлементы Цикл
		Если Элементы.Стратегия.Развернут(стр.ПолучитьИдентификатор()) Тогда
			ОткрытыеГруппы.Добавить(стр.Ссылка);
			ЗаполнитьРазвернутыеГруппы(стр.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьСостояниеДерева()
	ВосстановитьРазвернутыеГруппы(СтратегияДерево.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьРазвернутыеГруппы(пЭлементы)
	Для каждого стр из пЭлементы Цикл
		Если ОткрытыеГруппы.НайтиПоЗначению(стр.Ссылка)<>Неопределено Тогда
			Элементы.Стратегия.Развернуть(стр.ПолучитьИдентификатор());
		КонецЕсли;
		Если стр.Ссылка = ТекущаяСсылка Тогда
			Элементы.Стратегия.ТекущаяСтрока = стр.ПолучитьИдентификатор();
		КонецЕсли;
		ВосстановитьРазвернутыеГруппы(стр.ПолучитьЭлементы())
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура СтратегияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СтратегияЗадачаОтправлена" и (ЗначениеЗаполнено(Элемент.ТекущиеДанные.Задача) ИЛИ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЗадачаДоклад)) Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Задача) Тогда
			ПоказатьЗначение(,Элемент.ТекущиеДанные.Задача);
		Иначе
			ПоказатьЗначение(,Элемент.ТекущиеДанные.ЗадачаДоклад);
		КонецЕсли;
	ИначеЕсли РежимВыбора Тогда
		тд = Элементы.Стратегия.ТекущиеДанные;
		Если тд.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача") Тогда
			Закрыть(новый Структура("Содержание,ссылка,Ответственный",тд.Содержание,тд.ссылка,тд.Ответственный));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	тд = Элементы.Стратегия.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(тд.Задача) и НадоЗавершитьЗадачу(тд.Задача) тогда
		ИА_АдминшкалаСервер.ЗавершитьЗадачу(тд.Задача);
	КонецЕсли;
	ПометитьКакВыполнено(тд.Ссылка);
	
	ОбновитьДеревоССохранениемСостояния();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПометитьКакВыполнено(пСсылка)
	о = пСсылка.Получитьобъект();
	о.Выполнено = истина;
	о.ДатаВыполнения = ТекущаяДата();
	о.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НадоЗавершитьЗадачу(пЗадача)
	Возврат не пЗадача.Выполнена;
КонецФункции

&НаКлиенте
Процедура Отбор_ПриИзменении(Элемент)
	Если РежимГант Тогда
		ОбновитьГанта(Неопределено);
	Иначе
		Если ЗначениеЗаполнено(Отбор_ЗадачиПоста) или Отбор_ТолькоНезавершенные или Отбор_ТолькоПросроченные или Отбор_ТолькоРабочие Тогда
			ОбновитьДерево(); // все свернули
			ТекИд = -100;
			РазвернутьЗадачи(СтратегияДерево.ПолучитьЭлементы());
			Если ТекИд<>-100 Тогда
				Элементы.Стратегия.ТекущаяСтрока = ТекИд;
			КонецЕсли;
		Иначе
			ОбновитьДеревоССохранениемСостояния();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьЗадачи(пСтроки)
	Для каждого стр из пСтроки Цикл
		если стр.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача") Тогда
			Если ТекИд = -100 Тогда
				ТекИд = стр.ПолучитьИдентификатор();
			КонецЕсли;
			ид = стр.ПолучитьРодителя().ПолучитьИдентификатор();
			Элементы.Стратегия.Развернуть(ид);
			возврат;
		Иначе
			РазвернутьЗадачи(стр.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	ОбновитьДерево();
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	РазвернутьСтроки(СтратегияДерево.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСтроки(пСтроки)
	Для каждого стр из пСтроки Цикл
		Элементы.Стратегия.Развернуть(стр.ПолучитьИдентификатор());
		РазвернутьСтроки(стр.ПолучитьЭлементы());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьВверх(Команда)
	Сдвинуть(-1);
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьВниз(Команда)
	Сдвинуть(1);
КонецПроцедуры

&НаКлиенте
Процедура Сдвинуть(ВерхНиз)
	тс = Элементы.Стратегия.ТекущаяСтрока;
	ТекСтрока = СтратегияДерево.НайтиПоИдентификатору(тс); 
	
	Родитель = ?(ТекСтрока.ПолучитьРодителя() = Неопределено, СтратегияДерево, ТекСтрока.ПолучитьРодителя());
	Коллекция = Родитель.ПолучитьЭлементы();
	
	// удалим архив
	сч = Коллекция.Количество()-1;
	Пока сч>=0 Цикл
		текСтр = Коллекция[сч];
		Если текСтр.ЭтоАрхив Тогда
			Коллекция.Удалить(текСтр);
		КонецЕсли;
		
		сч = сч - 1;
	КонецЦикла;
	
	Инд = Коллекция.Индекс(ТекСтрока);
	Попытка
		СдвигЭлем = Коллекция.Получить(Инд + ?(ВерхНиз=1,2,-1));
		Если СдвигЭлем.ЭтоКоррекция и не СдвигЭлем.Коррекция_Добавление Тогда
			ВерхНиз = ВерхНиз * 2; // проскакиваем коррекции и элементы которые они корректируют
		КонецЕсли;
	Исключение
	КонецПопытки;
	Коллекция.Сдвинуть(Инд,ВерхНиз);
	
	//
	КоллСсылок = Новый массив;
	Для каждого стр из Коллекция Цикл
		Если не стр.ЭтоКоррекция ИЛИ стр.Коррекция_Добавление Тогда
			КоллСсылок.Добавить(стр.Ссылка);
		КонецЕсли;
	КонецЦикла;
	СохранитьСдвиг(КоллСсылок);
	//
	
	ОбновитьДоступностьСдвигов();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьСдвиг(КоллекцияСсылок)
	ИА_Защита_Админшкала.СохранитьСдвиг(КоллекцияСсылок);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если не ИА_Защита_Общий.ЛицензияДоступна("Админшкала") Тогда
		Отказ = Истина;
		возврат;
	КонецЕсли;
	
	ОбновитьОтобрРежима();	
	
	Если РежимВыбора Тогда
		ЭтаФорма.КоманднаяПанель.Видимость = Ложь;
		Элементы.Стратегия.ТолькоПросмотр = истина;
		Отбор_ПриИзменении(Неопределено);
		Элементы.ДиаграммаГанта.Видимость = Ложь;
	Иначе
		ОбновитьДерево();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор_ЗРС) ТОгда
		Элементы.Стратегия.ТолькоПросмотр = истина;
		Элементы.Стратегия.ПоложениеКоманднойПанели=ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	Иначе
		Элементы.ГруппаКП_Коррекция.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПометитьОтправленоВЗадаче(пЗадача)
	об = пЗадача.ПолучитьОбъект();
	об.ОтчетОтправлен = истина;
	об.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьОтчетОбИсполнении(Команда)
	тд = Элементы.Стратегия.ТекущиеДанные;
	
	Программа = ИА_АдминшкалаСервер.ПолучитьПрограммуЗадачи(тд.ссылка);
	
	Если Программа = Неопределено тогда
		Сообщить("Неверная структура данных. Задача не в программе!");
		Возврат;
	КонецЕсли;
	
	Отв = ИА_АдминшкалаСервер.ПолучитьОтветственногоПрограммы(Программа);
	Если отв.Пустая() Тогда
		Сообщить("В программе не указан ответственный за задачи! Отчет не отправлен!");
		Возврат;
	КонецЕсли;
	
	НаименованиеЗадачи = СокрЛП(тд.Содержание);
	Если СтрДлина(НаименованиеЗадачи)>70 Тогда
		НаименованиеЗадачи = лев(НаименованиеЗадачи,70)+"...";
	КонецЕсли;
	НаименованиеЗадачи = СтрЗаменить(НаименованиеЗадачи, Символы.ПС, " ");
	
	НаименованиеПрограммы = ИА_АдминшкалаСервер.ПолучитьНаименованиеПрограммы(Программа);
	
	СодержаниеЗ = "Задача """+НаименованиеЗадачи+""" из программы """+НаименованиеПрограммы+""" выполнена. Прошу подтвердить. "+Символы.ПС+"Доказательства (напишите текст или прикрепите файл или объект базы данных):"+Символы.ПС ;
	ПользЗ = ИА_ОбщиеПроцедурыКЦиОргсхема.ПолучитьПользователяНаПосту(Отв);
	НаименованиеЗ = "Доклад об исполнении задачи: "+НаименованиеЗадачи;
	Парам = Новый структура("ЗадачаСУ,Наименование,Пост,Пользователь,Содержание",тд.Ссылка,НаименованиеЗ,Отв,ПользЗ,СодержаниеЗ);
	
	ОткрытьФорму("Задача.ИА_ЗадачаПланаДействий.ФормаОбъекта",Парам,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьАрхивныеКопии(Команда)
	Отбор_Архив = Элементы.Стратегия.ТекущиеДанные.Ссылка;
	Отбор_ПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьАрхивныеКопии(Команда)
	Отбор_Архив = ПредопределенноеЗначение("Справочник.ИА_СтратегическоеУправление.ПустаяСсылка");
	Отбор_ПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТекущуюЗадачу(Команда)
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	ЭлементыРод = СтратегияДерево.НайтиПоИдентификатору(тд.ПолучитьИдентификатор()).ПолучитьРодителя().ПолучитьЭлементы();
	
	индекс = ЭлементыРод.Индекс(тд); 
	Новстр = ЭлементыРод.Вставить(индекс+1);
	ЗаполнитьЗначенияСвойств(Новстр, тд,,"Ссылка,ЗадачВсего,ЗадачВыполнено,ПроцентВыполнения,ЗадачПросрочено");
	Новстр.ЭтоКоррекция = истина;
	Новстр.ИндексКартинки = 7;
	Новстр.Коррекция_Автор = ТекущийПользователь;
	Новстр.СсылкаНаКоррЭлемент = тд.ссылка;
	Новстр.ПравоРедактирования = истина;
	
	ТекИД = Новстр.ПолучитьИдентификатор();
	ЗаписатьТекСтроку(ТекИД);
	Элементы.Стратегия.ТекущаяСтрока = ТекИД;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗадачу(Команда)
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	ТипЭлементаРодителя = тд.ТипРодителя;
	
	ЭлементыРод = СтратегияДерево.НайтиПоИдентификатору(тд.ПолучитьИдентификатор()).ПолучитьРодителя().ПолучитьЭлементы();
	
	Новстр = ЭлементыРод.Добавить();
	Новстр.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача");
	Новстр.ТипРодителя = ТипЭлементаРодителя;
	Новстр.ЗадачаОтправлена = 2;
	Новстр.Содержание = "<...>";
	Новстр.ПравоРедактирования = истина;
	Новстр.ПравоПросмотра = истина;
	Новстр.ЭтоКоррекция = истина;
	Новстр.Коррекция_Добавление = истина;
	Новстр.ИндексКартинки = 7;
	Новстр.Коррекция_Автор = ТекущийПользователь;
	
	ТекИД = Новстр.ПолучитьИдентификатор();
	ЗаписатьТекСтроку(ТекИД);
	Элементы.Стратегия.ТекущаяСтрока = ТекИД;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗадачу(Команда)
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	ЭлементыРод = СтратегияДерево.НайтиПоИдентификатору(тд.ПолучитьИдентификатор()).ПолучитьРодителя().ПолучитьЭлементы();
	
	индекс = ЭлементыРод.Индекс(тд); 
	Новстр = ЭлементыРод.Вставить(индекс+1);
	ЗаполнитьЗначенияСвойств(Новстр, тд,,"Ссылка,ЗадачВсего,ЗадачВыполнено,ПроцентВыполнения,ЗадачПросрочено");
	Новстр.ЭтоКоррекция = истина;
	Новстр.ИндексКартинки = 7;
	Новстр.Коррекция_Автор = ТекущийПользователь;
	Новстр.СсылкаНаКоррЭлемент = тд.ссылка;
	Новстр.Коррекция_Удаление = истина;
	Новстр.ПравоРедактирования = Ложь;
	
	ТекИД = Новстр.ПолучитьИдентификатор();
	ЗаписатьТекСтроку(ТекИД);
	Элементы.Стратегия.ТекущаяСтрока = ТекИД;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьКоррекцию(Команда)
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	Элем = СтратегияДерево.НайтиПоИдентификатору(тд.ПолучитьИдентификатор());
	ЭлементыРод = Элем.ПолучитьРодителя().ПолучитьЭлементы();
	ЭлементыРод.Удалить(Элем);
	
	Если ЗначениеЗаполнено(тд.Ссылка) Тогда
		ПометитьНаУдаление(тд.Ссылка);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗРСНаКоррекцию(Команда)
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	Если тд.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Программа") Тогда
		Программа = тд.Ссылка;
	Иначе
		Программа = ИА_АдминшкалаСервер.ПолучитьПрограммуЗадачи(тд.Ссылка);
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Программа) Тогда
		возврат;
	КонецЕсли;
	
	Коррекции = ПолучитьКоррекци(Программа);
	Если Коррекции.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"В данной программе нет коррекций");
		Возврат;
	КонецЕсли;
	
	
	Отв = ИА_АдминшкалаСервер.ПолучитьОтветственногоПрограммы(Программа);
	Если отв.Пустая() Тогда
		Сообщить("В программе не указан ответственный за задачи! ЗРС не отправлена!");
		Возврат;
	КонецЕсли;
	
	НаименованиеПрограммы = ИА_АдминшкалаСервер.ПолучитьНаименованиеПрограммы(Программа);
	НаименованиеПрограммы = СтрЗаменить(НаименованиеПрограммы,"<","&lt;");
	НаименованиеПрограммы = СтрЗаменить(НаименованиеПрограммы,">","&gt;");
	
	Тема = "Корректировка программы: "+НаименованиеПрограммы;
	
	Решение = ПолучитьРешениеЗРСКоррекции(Коррекции);	
	//
	форм = ПолучитьФорму("Задача.ИА_ЗадачаПланаДействий.ФормаОбъекта",Новый структура("ЭтоЗРС",истина));
	форм.ЭтоЗРС = истина;
	форм.Объект.ЭтоЗРС = истина;
	форм.Объект.Наименование = Тема;
	форм.Объект.Пост = Отв;	
	форм.Объект.Пользователь = ИА_ОбщиеПроцедурыКЦиОргсхема.ПолучитьПользователяНаПосту(Отв);
	форм.Объект.Содержание = Решение;
	//форм.ПеречитатьПоляФД();
	
	форм.Объект.ЭтоКоррекцияСУ = истина;
	форм.Объект.ПрикрепленныйОбъект = Программа;
	форм.Записать();
	
	ПрописатьЗРС_В_Коррекции(Коррекции, форм.Объект.Ссылка);
	ОбновитьДеревоССохранениемСостояния();
	
	форм.Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрописатьЗРС_В_Коррекции(Коррекции, ЗРС)
	Для каждого стр из Коррекции Цикл
		об = стр.ПолучитьОбъект();
		об.Коррекция_ЗРС = ЗРС;
		об.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРешениеЗРСКоррекции(Коррекции)
	Рез = "Прошу одобрить следующие корректировки задач:" + Символы.ПС;
	Для каждого КоррСсылка из Коррекции Цикл
		НаименованиеЗадачи = СокрЛП(КоррСсылка.Содержание);		
		
		НаименованиеИсходнойЗадачи = СокрЛП(КоррСсылка.СсылкаНаКоррЭлемент.Содержание);		
		
		Если КоррСсылка.Коррекция_Удаление Тогда
			Рез = Рез + "[УДАЛЕНИЕ] " + НаименованиеЗадачи + Символы.ПС + Символы.ПС;
		ИначеЕсли КоррСсылка.Коррекция_Добавление Тогда
			Рез = Рез + "[НОВАЯ ЗАДАЧА] " + НаименованиеЗадачи  + Символы.ПС + Символы.ПС;
		Иначе
			Рез = Рез + "[КОРРЕКЦИЯ] " + НаименованиеИсходнойЗадачи + Символы.ПС;
			Если НаименованиеЗадачи <> НаименованиеИсходнойЗадачи Тогда
				Рез = Рез + "[Новое содержание задачи] " + НаименованиеЗадачи + Символы.ПС;
			КонецЕсли;
			Если КоррСсылка.Срок <> КоррСсылка.СсылкаНаКоррЭлемент.Срок Тогда
				Рез = Рез + "[Новый срок] " + ФОРМАТ(КоррСсылка.Срок,"ДФ=dd.MM.yyyy") + Символы.ПС;
			КонецЕсли;
			Рез = Рез + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	Возврат Рез;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКоррекци(Программа)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИА_СтратегическоеУправление.Ссылка
	|ИЗ
	|	Справочник.ИА_СтратегическоеУправление КАК ИА_СтратегическоеУправление
	|ГДЕ
	|	ИА_СтратегическоеУправление.Ссылка В ИЕРАРХИИ(&Ссылка)
	|	И ИА_СтратегическоеУправление.ЭтоКоррекция
	|	И ИА_СтратегическоеУправление.Коррекция_Автор = &Пользователь
	|	И ИА_СтратегическоеУправление.ПометкаУдаления = ЛОЖЬ
	|	И ИА_СтратегическоеУправление.Коррекция_ЗРС = ЗНАЧЕНИЕ(Задача.ИА_ЗадачаПланаДействий.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Ссылка", Программа);
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

&НаКлиенте
Процедура СледующаяКоррекция(Команда) Экспорт
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено Тогда
		ТекИд = 1;
	Иначе
		текИД = тд.ПолучитьИдентификатор() + 1;
	КонецЕсли;
	
	СледЭлем = СтратегияДерево.НайтиПоИдентификатору(текИД);
	Пока СледЭлем<>Неопределено Цикл
		Если СледЭлем.ЭтоКоррекция Тогда
			Элементы.Стратегия.ТекущаяСтрока =  текИД;
			Возврат;
		КонецЕсли;
		
		текИД = ТекИд + 1;
		СледЭлем = СтратегияДерево.НайтиПоИдентификатору(текИД);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяКоррекция(Команда)
	тд = Элементы.Стратегия.ТекущиеДанные;
	Если тд = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	текИД = тд.ПолучитьИдентификатор() - 1;
	СледЭлем = СтратегияДерево.НайтиПоИдентификатору(текИД);
	Пока СледЭлем<>Неопределено Цикл
		Если СледЭлем.ЭтоКоррекция Тогда
			Элементы.Стратегия.ТекущаяСтрока =  текИД;
			Возврат;
		КонецЕсли;
		
		текИД = ТекИд - 1;
		СледЭлем = СтратегияДерево.НайтиПоИдентификатору(текИД);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПрограммы(Команда)
	ТабДок = ПечатьПрограммы_Сервер();
	ТабДок.Показать();
	//Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПечать;
КонецПроцедуры

&НаСервере
Функция ПечатьПрограммы_Сервер()
	ТабДокПечать = новый ТабличныйДокумент;
	
	СтрПрограмма = СтратегияДерево.НайтиПоИдентификатору(Элементы.Стратегия.ТекущаяСтрока);
	//СтрПрограмма = Элементы.Стратегия.ТекущиеДанные;  
	
	//ТабДокПечать = Новый ТабличныйДокумент;
	//Макет = Обработки.ИА_РабочийСтолСтратегическогоУправления.ПолучитьМакет("Программа");
	ОбъектМакет = РеквизитФормыВЗначение("Объект"); 
	Макет = ОбъектМакет.ПолучитьМакет("Программа");
	ТабДокПечать.Очистить(); 
	ТабДокПечать.НачатьАвтогруппировкуСтрок();  
	ОблШапка   = Макет.ПолучитьОбласть("Шапка");
	Раздел     = Макет.ПолучитьОбласть("Раздел");
	Задача     = Макет.ПолучитьОбласть("Задача");
	Задача1    = Макет.ПолучитьОбласть("Задача1");
	Задача2    = Макет.ПолучитьОбласть("Задача2");
	Задача3    = Макет.ПолучитьОбласть("Задача3");
	Задача4    = Макет.ПолучитьОбласть("Задача4");
	Задача5    = Макет.ПолучитьОбласть("Задача5");
	ЗадачаВРазделе    = Макет.ПолучитьОбласть("ЗадачаВРазделе");
	ОблШапка.Параметры.Наименование = СтрПрограмма.Содержание;
	ТабДокПечать.Вывести(ОблШапка, 1);
	
	Для каждого стрТип из СтрПрограмма.ПолучитьЭлементы() Цикл
		ОблСтрока = Макет.ПолучитьОбласть("ТипЗадачи");
		ОблСтрока.Параметры.Заполнить(стрТип);
		ТабДокПечать.Вывести(ОблСтрока, 2);
		
		// разделы и задачи
		Для каждого стрЗадачаРаздел из стрТип.ПолучитьЭлементы() Цикл
			// раздел
			Если стрЗадачаРаздел.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Раздел Тогда
				ОблСтрока = Раздел; ОблСтрока.Параметры.Заполнить(стрЗадачаРаздел);
				ТабДокПечать.Вывести(ОблСтрока, 3,,Истина);
				Для каждого стрЗадача из стрЗадачаРаздел.ПолучитьЭлементы() Цикл
					ОблСтрока = ЗадачаВРазделе;	ОблСтрока.Параметры.Заполнить(стрЗадача);
					ОблСтрока.Параметры.Ответственный = стрЗадача.Ответственный.Наименование;
					ТабДокПечать.Вывести(ОблСтрока, 4, ,Истина);
				КонецЦикла;
			Иначе    // задача	
				ОблСтрока = Задача;
				Если стрЗадачаРаздел.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Задача и
					стрЗадачаРаздел.Выполнено Тогда
					ОблСтрока = Задача2;
				КонецЕсли;	
				Если стрЗадачаРаздел.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Задача и
					стрЗадачаРаздел.ЗадачПросрочено Тогда
					ОблСтрока = Задача1; 
				КонецЕсли;	
				Если стрЗадачаРаздел.ЭтоАрхив Тогда
					ОблСтрока = Задача3; 
				КонецЕсли;
				Если стрЗадачаРаздел.ЭтоКоррекция Тогда
					ОблСтрока = Задача4;
				КонецЕсли;
				ОблСтрока.Параметры.Заполнить(стрЗадачаРаздел);
				ОблСтрока.Параметры.Ответственный = стрЗадачаРаздел.Ответственный.Наименование;
				ТабДокПечать.Вывести(ОблСтрока, 3,,Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТабДокПечать.ЗакончитьАвтогруппировкуСтрок();
	ТабДокПечать.АвтоМасштаб = Истина;
	ТабДокПечать.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокПечать.ОтображатьЗаголовки = Ложь;
	ТабДокПечать.ОтображатьСетку = Ложь;
	ТабДокПечать.ФиксацияСверху = 4;
	
	Возврат ТабДокПечать;
КонецФункции


&НаКлиенте
Процедура ОбновитьДерево1(Команда)
	ОбновитьДеревоССохранениемСостояния();
КонецПроцедуры


&НаКлиенте
Процедура СохранитьКакФайлExcel(Команда)	
	//ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	//ДиалогФайла.Фильтр = "Файл Excel (*.xls)|*.xls";
	//Если ДиалогФайла.Выбрать() Тогда
	//	ПолноеИмяСхраненногоФайла = ДиалогФайла.ПолноеИмяФайла;
	//	ТабДокПечать.Записать(ПолноеИмяСхраненногоФайла, ТипФайлаТабличногоДокумента.XLS);
	//КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьПоследнийСохраненныхФайл(Команда)	
	Если НЕ СокрЛП(ПолноеИмяСхраненногоФайла) = "" Тогда
		ЗапуститьПриложение(ПолноеИмяСхраненногоФайла);	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)	
	//ТабДокПечать.Напечатать(РежимИспользованияДиалогаПечати.Использовать);	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ТипЗадачиСуществует(ВыбТипЗадачи, Родитель)	//Григорьева
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИА_СтратегическоеУправление.Ссылка
	|ИЗ
	|	Справочник.ИА_СтратегическоеУправление КАК ИА_СтратегическоеУправление
	|ГДЕ
	|	ИА_СтратегическоеУправление.Родитель = &Родитель
	|	И НЕ ИА_СтратегическоеУправление.ПометкаУдаления
	|	И ИА_СтратегическоеУправление.ТипЭлемента = ЗНАЧЕНИЕ(Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.ТипЗадачи)
	|	И НЕ ИА_СтратегическоеУправление.НеПоказыватьНаРабочемСтоле
	|	И ИА_СтратегическоеУправление.ТипЗадачи = &ТипЗадачи";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Запрос.УстановитьПараметр("ТипЗадачи", ВыбТипЗадачи);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытиеЗадачиБП" и Параметр<>Неопределено  Тогда
		Если (не Параметр.Ссылка.Пустая())  Тогда
			тд = Элементы.Стратегия.ТекущиеДанные;
			ПометитьОтправленоВЗадаче(тд.Ссылка);		
			тд.ЗадачаОтправлена = 1;
			тд.ЗадачаДоклад = Параметр.Ссылка;
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьГантаНаСервере()
	дер = ИА_Защита_Админшкала.ПолучитьДеревоСУ(Отбор_ТолькоПросроченные, Отбор_ТолькоРабочие, Отбор_ТолькоНезавершенные, Отбор_ЗадачиПоста, Отбор_ПрограммыПоста, Отбор_Архив, Отбор_ЗРС, истина);
	
	ЗависимыеЗадачи.Очистить();
	
	Гант.Обновление = Ложь;
	Гант.Очистить();
	Гант.ОтображатьЛегенду = ложь;
	
	Серия = Гант.УстановитьСерию("Задачи"); 
	ЗагрузитьДеревоВГанта(дер.Строки, гант.Точки,Серия);
	
	Для каждого т из Гант.Точки Цикл
		Гант.РазвернутьТочку(т,истина);	
	КонецЦикла;
	
	Гант.Обновление = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДеревоВГанта(СтрокиДерева, ТочкиГанта,Серия)
	текДата = ТекущаяДата();
	
	Для каждого стр из СтрокиДерева Цикл
		Если ЗначениеЗаполнено(стр.ЗависитОтЗадачи) Тогда
			новСв = ЗависимыеЗадачи.Добавить();
			новСв.Задача = стр.Ссылка;
			новСв.ЗависитОтЗадачи = стр.ЗависитОтЗадачи;
		КонецЕсли;
		
		НовТочка = ТочкиГанта.Добавить();
		НовТочка.Значение = стр.Ссылка;
		НовТочка.Текст = стр.Содержание;
		
		Значение = Гант.ПолучитьЗначение(НовТочка, Серия);
		Значение.Редактирование = стр.ПравоРедактирования;
		// 
		Если стр.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Цель Тогда
			НовТочка.Картинка = БиблиотекаКартинок.ИА_Стратегия_Цель;
			НовТочка.Шрифт = Новый Шрифт(,13);
		ИначеЕсли стр.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.План Тогда
			НовТочка.Картинка = БиблиотекаКартинок.ИА_Стратегия_План;
			НовТочка.Шрифт = Новый Шрифт(,12);
		ИначеЕсли стр.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Программа Тогда
			НовТочка.Картинка = БиблиотекаКартинок.ИА_Стратегия_Программа;
			НовТочка.Шрифт = Новый Шрифт(,11);
		ИначеЕсли стр.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.ТипЗадачи Тогда
			НовТочка.Картинка = БиблиотекаКартинок.ИА_Стратегия_ТипЗадачи;
			НовТочка.Шрифт = Новый Шрифт(,10);
			
			Значение.Редактирование = ложь;
			
			стр.ДатаНачала = стр.ДатаНачалаМин;
			стр.Срок = стр.СрокМакс;

		ИначеЕсли стр.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Раздел Тогда			
			НовТочка.Картинка = БиблиотекаКартинок.ИА_Стратегия_Раздел;
			НовТочка.Шрифт = Новый Шрифт(,9);
		ИначеЕсли стр.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Задача Тогда			
			Если стр.Выполнено Тогда
				НовТочка.Картинка = БиблиотекаКартинок.ИА_Стратегия_ЗадачаВыполнена;
			Иначе
				НовТочка.Картинка = БиблиотекаКартинок.ИА_Стратегия_Задача;
			КонецЕсли;
			НовТочка.Шрифт = Новый Шрифт(,9);
		КонецЕсли;
		//
		Интервал = Значение.Добавить();
		
		Если не стр.ПравоРедактирования Тогда
			Интервал.Цвет = Новый цвет(230,230,255);
		ИначеЕсли не (ЗначениеЗаполнено(стр.ДатаНачала) И ЗначениеЗаполнено(стр.ДатаНачала)) Тогда
			Интервал.Цвет = Новый цвет(200,200,255);
		Иначе
			Интервал.Цвет = Новый цвет(150,150,255);
		КонецЕсли;
		
		Если стр.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Задача Тогда
			Если стр.Выполнено Тогда
				Интервал.Цвет = Новый цвет(190,255,190);
			ИначеЕсли ЗначениеЗаполнено(стр.Срок) и стр.Срок < НачалоДня(ТекущаяДата()) ТОгда
				Интервал.Цвет = Новый цвет(255,190,190);
			КонецЕсли;
		КонецЕсли;
		
		дн = ?(ЗначениеЗаполнено(стр.ДатаНачала),стр.ДатаНачала,стр.ДатаНачалаМин);
		дк = ?(ЗначениеЗаполнено(стр.Срок),КонецДня(стр.Срок),КонецДня(стр.СрокМакс));
		Если дк < дн Тогда
			дк = дн + 60*60*24;
		КонецЕсли;
		
		Интервал.Начало = ?(ЗначениеЗаполнено(дн),дн,текДата);
		Интервал.Конец = КонецДня(?(ЗначениеЗаполнено(дк),дк,текДата));
				
		ЗагрузитьДеревоВГанта(стр.Строки, НовТочка.Точки, Серия)
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГанта(Команда)
	Если Элементы.СохранитьИзменения.Доступность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбновитьГантаЗавершение", ЭтаФорма), "Данные были изменены. Сохранить?",РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	ОбновитьГантаФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГантаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СохранитьИзменения(Неопределено);
	КонецЕсли;		
	
	ОбновитьГантаФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГантаФрагмент()
	
	ОбновитьГантаНаСервере(); 
	ОбновитьТекстыВсехИнтервалов();
	ОбновитьСвязи(гант.Точки);
	Элементы.СохранитьИзменения.Доступность = ложь;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСвязи(точки)
	Для каждого т из точки Цикл
		нстроки = ЗависимыеЗадачи.НайтиСтроки(новый Структура("Задача", т.значение));
		если нстроки.Количество() > 0 Тогда
			ЗадачаИсх = нстроки[0].Задача;
			ЗадачаОтКоторойЗав = нстроки[0].ЗависитОтЗадачи;
			ТочкаЗав = ПолучитьТочкуПоЗначению(ЗадачаОтКоторойЗав,т.Родитель);
			
			Серия = Гант.Серии[0];			
			знчОт = Гант.ПолучитьЗначение(ТочкаЗав, Серия);
			ДЛя каждого ИнтервалОт из знчОт Цикл
			КонецЦикла;
			знчДо = Гант.ПолучитьЗначение(т, Серия);
			ДЛя каждого ИнтервалДо из знчДо Цикл
			КонецЦикла;
			
			ИнтервалОт.Добавить(ИнтервалДо);
		КонецЕсли;
		ОбновитьСвязи(т.точки);		
	КонецЦикла;
КонецПроцедуры	
	
&НаКлиенте
Процедура ГантПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования)
	Элементы.СохранитьИзменения.Доступность = истина;	
	ОбновитьТекстыВсехИнтервалов();
	
	// зависимые задачи
	ТекЗадача = Интервал.Значение.Точка.Значение;
	СдвинутьЗависящиеЗадачи(ТекЗадача, Интервал.Конец);
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьЗависящиеЗадачи(ТекЗадача, конец)
	
	нстроки = ЗависимыеЗадачи.НайтиСтроки(новый Структура("ЗависитОтЗадачи", ТекЗадача));
	Если нстроки.Количество() > 0 Тогда
		ТочкаЗав = ПолучитьТочкуПоЗначению(нстроки[0].Задача, Гант);
		
		Серия = Гант.Серии[0];			
		знЗависимое = Гант.ПолучитьЗначение(ТочкаЗав, Серия);
		ДЛя каждого ИнтервалЗависимый из знЗависимое Цикл
			длительность = ИнтервалЗависимый.Конец - ИнтервалЗависимый.Начало;
			ИнтервалЗависимый.Начало = Конецдня(Конец) + 1;
			ИнтервалЗависимый.Конец = ИнтервалЗависимый.Начало + длительность;
			
			СдвинутьЗависящиеЗадачи(ТочкаЗав.Значение, ИнтервалЗависимый.Конец);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура СохранитьИзмененияТочек(точки)
	с= гант.Серии[0];
	Для каждого т из Точки Цикл
		зн = гант.ПолучитьЗначение(т,с);
		Для каждого инт из зн Цикл
			об = т.Значение.ПолучитьОбъект();
			об.ДатаНачала = инт.Начало;
			об.Срок = инт.Конец;
			об.Записать();
		КонецЦикла;		
		СохранитьИзмененияТочек(т.Точки);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	СохранитьИзмененияТочек(гант.Точки);
КонецПроцедуры


&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьИзмененияНаСервере();
	Элементы.СохранитьИзменения.Доступность = ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстыВсехИнтервалов()
	гант.Обновление = ложь;
	ОбновитьТекстыИнтервалов(гант.Точки);
	гант.Обновление = Истина;
КонецПроцедуры
	
&НаКлиенте
Процедура ОбновитьТекстыИнтервалов(точки)
	с= гант.Серии[0];
	Для каждого т из точки Цикл
		зн = гант.ПолучитьЗначение(т,с);
		Для каждого инт из зн Цикл
			инт.Текст = формат(инт.Начало,"ДФ=dd.MM")+"-"+формат(инт.Конец,"ДФ=dd.MM");
		КонецЦикла;
		ОбновитьТекстыИнтервалов(т.точки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаГанта(Команда)
	РежимГант = не РежимГант;
	ОбновитьОтобрРежима();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтобрРежима()
	
	Элементы.ГруппаКПГлавная.Видимость = не РежимГант;
	Элементы.Стратегия.Видимость = не РежимГант;
	Элементы.ГруппаКП_Коррекция.Видимость = ЗначениеЗаполнено(Отбор_ЗРС) и не РежимГант;
	
	Элементы.ГруппаКПГант.Видимость = РежимГант;
	Элементы.Гант.Видимость = РежимГант;
	
	Если РежимГант Тогда
		ОбновитьГанта(Неопределено);
	Иначе
		ОбновитьДеревоССохранениемСостояния();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГантВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
	если типзнч(Значения) = тип("ТочкаДиаграммыГанта") И ТипЗнч(Значения.Значение) = тип("СправочникСсылка.ИА_СтратегическоеУправление") Тогда
		Если Элементы.СохранитьИзменения.Доступность Тогда
			ПоказатьПредупреждение(,"Перед открытием задачи сохраните все изменения");
	        Возврат;
		КонецЕсли;
		оп = новый ОписаниеОповещения("ГантВыборЗакрытие",ЭтаФорма,новый Структура("знч", Значения.Значение));
		ОткрытьФорму("Справочник.ИА_СтратегическоеУправление.ФормаОбъекта", новый структура("Ключ", Значения.Значение),,,,,оп);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТочкуПоЗначению(зн,ТекСтр)
	Для каждого т из ТекСтр.Точки Цикл
		если т.значение = зн Тогда
			возврат т;
		КонецЕсли;
		рез = ПолучитьТочкуПоЗначению(зн, т);
		Если рез<> Неопределено ТОгда
			возврат рез;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;		
КонецФункции

&НаКлиенте
Процедура ГантВыборЗакрытие(ВыбЗн, ДопПарам) Экспорт
	Серия = Гант.Серии[0]; 
	//Точка = гант.Точки.Получить(ДопПарам.ТочкаИнд);
	точка = ПолучитьТочкуПоЗначению(ДопПарам.знч, Гант);
	
	знч = Гант.ПолучитьЗначение(Точка, Серия);
	ДЛя каждого Интервал из знч Цикл
	КонецЦикла;
	
	ДанныеЗадачи = ПолучитьДанныеЗадачи(ДопПарам.знч);
	
	Если ЗначениеЗаполнено(ДанныеЗадачи.ДатаНачала) Тогда
		интервал.Начало = ДанныеЗадачи.ДатаНачала;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеЗадачи.Срок) Тогда
		интервал.Конец = КонецДня(ДанныеЗадачи.Срок);
	КонецЕсли;
	
	Если ДанныеЗадачи.Выполнено Тогда
		Интервал.Цвет = Новый цвет(190,255,190);
	ИначеЕсли ЗначениеЗаполнено(ДанныеЗадачи.Срок) и ДанныеЗадачи.Срок < НачалоДня(ТекущаяДата()) ТОгда
		Интервал.Цвет = Новый цвет(255,190,190);
	КонецЕсли;
	
	точка.Текст = ДанныеЗадачи.Содержание;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеЗадачи(з)
	Возврат новый структура("ДатаНачала, Срок, Выполнено, Содержание", з.ДатаНачала, з.Срок, з.Выполнено, з.Содержание);
КонецФункции
